       IDENTIFICATION DIVISION.
                PROGRAM-ID. HELLOWORLD.
       PROCEDURE DIVISION.
           DISPLAY "Hello, World".
       END PROGRAM HELLOWORLD.
